In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

from sklearn.preprocessing import LabelEncoder 
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, precision_score, \
    confusion_matrix, f1_score, roc_auc_score, recall_score

In [2]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')
data = pd.concat([train, test], sort=True)

In [3]:
train.head()
# train.shape

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test.head()
# test.shape

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [7]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
ageMean = train['Age'].mean()
train['Age'] = train.Age.fillna(method="ffill")

In [9]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
train = train.drop(columns = ['Name', 'Ticket', 'Cabin'])
train.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [11]:
train.Embarked = train.Embarked.fillna('S')

In [12]:
le = LabelEncoder()
train['Sex'] = le.fit_transform(train['Sex'])
train['Embarked'] = le.fit_transform(train['Embarked'])

In [13]:
# train['Sex'].replace(['male','female'],[0,1],inplace=True)
# train['Embarked'].replace(['S','C','Q'],[0,1,2],inplace=True)

In [14]:
features = ['Pclass', 'Fare', 'Sex', 'Age', 'SibSp', 'Parch', 'Embarked']
X = train[features]
Y = train['Survived']

In [15]:
train_X, test_X, train_Y, test_Y = train_test_split(X, Y, test_size = 0.3, random_state = 0)

In [32]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression(solver="liblinear")
lr.fit(train_X, train_Y)
lr_predictions = lr.predict(test_X)
print("Accuracy Score:", accuracy_score(test_Y, lr_predictions))
print("F1 Score:", f1_score(test_Y, lr_predictions))
print("Recall Score:", recall_score(test_Y, lr_predictions))

Accuracy Score: 0.8022388059701493
F1 Score: 0.7282051282051281
Recall Score: 0.71

In [17]:
from xgboost import XGBClassifier
xgb = XGBClassifier(n_estimators=300)
xgb.fit(train_X, train_Y)
xgb_predictions = xgb.predict(test_X)
print("XGBoostClassifier model")
print("Accuracy Score:", accuracy_score(test_Y, xgb_predictions))
print("F1 Score:", f1_score(test_Y, xgb_predictions))
print("Recall Score:", recall_score(test_Y, xgb_predictions))

XGBoostClassifier model
Accuracy Score: 0.8171641791044776
F1 Score: 0.7512690355329948
Recall Score: 0.74

In [18]:
from sklearn.ensemble import RandomForestClassifier
randf = RandomForestClassifier(n_estimators = 900, random_state = 0)
randf.fit(train_X, train_Y)
randf_predictions = randf.predict(test_X)
print("RandomForestClassifier model")
print("Accuracy Score:", accuracy_score(test_Y, randf_predictions))
print("F1 Score:", f1_score(test_Y, randf_predictions))
print("Recall Score:", recall_score(test_Y, randf_predictions))

RandomForestClassifier model
Accuracy Score: 0.8134328358208955
F1 Score: 0.7448979591836735
Recall Score: 0.73

In [19]:
ageMean = test.Age.mean()
test['Age'] = test.Age.fillna(ageMean)

In [20]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [21]:
test = test.drop(columns = [ 'Name', 'Ticket', 'Cabin'])

In [22]:
test['Fare'] = test.Fare.fillna(7.75)

In [23]:
test['Sex'] = le.fit_transform(test['Sex'])
test['Embarked'] = le.fit_transform(test['Embarked'])
test.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0          892       3    1  34.5      0      0   7.8292         1
1          893       3    0  47.0      1      0   7.0000         2
2          894       2    1  62.0      0      0   9.6875         1
3          895       3    1  27.0      0      0   8.6625         2
4          896       3    0  22.0      1      1  12.2875         2

In [24]:
# test['Sex'].replace(['male','female'],[0,1],inplace=True)
# test['Embarked'].replace(['S','C','Q'],[0,1,2],inplace=True)
# test.head()

In [25]:
features = ['Pclass', 'Fare', 'Sex', 'Age', 'SibSp', 'Parch', 'Embarked']

In [26]:
result_lr_model = lr.predict(test[features])
result_xgb_model = xgb.predict(test[features])
result = randf.predict(test[features])

In [27]:
result_df = pd.DataFrame(result)
result_df.index = test.PassengerId
result_df.columns = ['Survived']
result_df.to_csv("result3.csv")